In [2]:
import pandas as pd

In [11]:
raw_data = {
    "city" : ["Tripoli", "Sydney", "Tripoli", "Rome", "Rome", "Tripoli", "Rome", "Sydney", "Sydney"],
    "rank" : ["1st", "2nd", "1st", "2nd", "1st", "2nd", "1st", "2nd", "1st"],
    "score1" : [44, 48, 39, 41, 38, 44, 34, 54, 61],
    "score2" : [67, 63, 55, 70, 64, 77, 45, 66, 72]
}

df = pd.DataFrame(raw_data, columns = ['city', 'rank', 'score1', 'score2'])
df

      city rank  score1  score2
0  Tripoli  1st      44      67
1   Sydney  2nd      48      63
2  Tripoli  1st      39      55
3     Rome  2nd      41      70
4     Rome  1st      38      64
5  Tripoli  2nd      44      77
6     Rome  1st      34      45
7   Sydney  2nd      54      66
8   Sydney  1st      61      72

In [12]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [13]:
df.duplicated(['city'])

0    False
1    False
2     True
3    False
4     True
5     True
6     True
7     True
8     True
dtype: bool

In [14]:
df.duplicated(['rank','city'])

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7     True
8    False
dtype: bool

In [15]:
df.drop_duplicates(['city', 'rank'])

      city rank  score1  score2
0  Tripoli  1st      44      67
1   Sydney  2nd      48      63
3     Rome  2nd      41      70
4     Rome  1st      38      64
5  Tripoli  2nd      44      77
8   Sydney  1st      61      72

In [16]:
df.drop_duplicates(['city'])

      city rank  score1  score2
0  Tripoli  1st      44      67
1   Sydney  2nd      48      63
3     Rome  2nd      41      70